export const nav = [
  { text: "主页", link: "/" },
  {
    text: "前端开发",
    items: [
      {
        text: "前端基础",
        link: "/前端开发/前端基础/",
      },
      {
        text: "前端框架",
        link: "/前端开发/前端框架/",
      },
      {
        text: "打包工具",
        link: "/前端开发/打包工具/",
      },
      {
        text: "代码规范",
        link: "/前端开发/代码规范/",
      },
    ],
  },
  {
    text: "计算机基础",
    items: [
      {
        text: "计算机网络",
        link: "/计算机基础/计算机网络/",
      },
      {
        text: "操作系统",
        link: "/计算机基础/操作系统/",
      },
      {
        text: "组成原理",
        link: "/计算机基础/组成原理/",
      },
      {
        text: "数据结构",
        link: "/计算机基础/数据结构/",
      },
      {
        text: "编译原理",
        link: "/计算机基础/编译原理/",
      },
    ],
  },
];
